rentscape_api/app/controllers/properties_controller.rb

DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 23]]
---
  def validate_destroy
    if @property.authenticate(params[:password])
      @property.destroy