rentscape_api/app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def create
    @property = Property.new(property_params)
    if @property.save
---
INSERT INTO "properties" ("address", "address_2", "township", "state", "review_title", "review", "overall_rating", "landlord_rating", "cleanliness_rating", "neighbors_rating", "price_rating", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @property.update(property_params)
---
UPDATE "properties" SET "updated_at" = ? WHERE "properties"."id" = ?  [["updated_at", "2021-06-05 21:40:33.282489"], ["id", 23]]

  def destroy
    @property.destroy
---
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 23]]

    def set_property
      @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]